{
  "21": {
    "name": "fire lily",
    "description": "Fire lily may refer to:",
    "image_url": null
  },
  "3": {
    "name": "canterbury bells",
    "description": "Campanula medium, common name Canterbury bells, is an annual or biennial flowering plant of the genus Campanula, belonging to the family Campanulaceae. In floriography, it represents gratitude, or faith and constancy.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Campanulaceae_-_Campanula_medium-4.JPG/330px-Campanulaceae_-_Campanula_medium-4.JPG"
  },
  "45": {
    "name": "bolero deep blue",
    "description": "Eustoma russellianum is a species of flowering plant in the gentian family. One of its previous binomial names was Eustoma grandiflorum. Common names include showy prairie gentian, prairie gentian, Texas bluebells, Texas bluebell, bluebell, and Lisianthus.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/Eustoma_grandiflorum_purple_02.jpg/330px-Eustoma_grandiflorum_purple_02.jpg"
  },
  "1": {
    "name": "pink primrose",
    "description": "Oenothera speciosa is a species in the evening primrose family known by several common names, including pinkladies, pink evening primrose, showy evening primrose, Mexican primrose, and buttercups.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Showy_Primrose.JPG/330px-Showy_Primrose.JPG"
  },
  "34": {
    "name": "mexican aster",
    "description": "Cosmos bipinnatus, commonly called the garden cosmos, Mexican aster or cosmea, is a medium-sized flowering herbaceous plant in the daisy family Asteraceae, native to the Americas. The species and its varieties and cultivars are popular as ornamental plants in temperate climate gardens.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Cosmos_bipinnatus_pink%2C_Burdwan%2C_West_Bengal%2C_India_10_01_2013.jpg/330px-Cosmos_bipinnatus_pink%2C_Burdwan%2C_West_Bengal%2C_India_10_01_2013.jpg"
  },
  "27": {
    "name": "prince of wales feathers",
    "description": "No description found.",
    "image_url": null
  },
  "7": {
    "name": "moon orchid",
    "description": "Phalaenopsis amabilis, commonly known as the moon orchid, moth orchid, or mariposa orchid, is a species of flowering plant in the orchid family Orchidaceae. It is widely cultivated as a decorative houseplant. It is an epiphytic or lithophytic herb with long, thick roots, between two and eight thick, fleshy leaves with their bases hiding the stem and nearly flat, white, long-lasting flowers on a branching flowering stem with up to ten flowers on each branch.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Phalaenopsis_amabilis_Orchi_198.jpg/330px-Phalaenopsis_amabilis_Orchi_198.jpg"
  },
  "16": {
    "name": "globe-flower",
    "description": "Trollius is a genus of about 30 species of flowering plants closely related to Ranunculus, in the family Ranunculaceae. The common name of some species is globeflower or globe flower. The generic name is derived from the Swiss-German word \"Trollblume\", meaning a rounded flower. Native to the cool temperate regions of the Northern Hemisphere, with the greatest diversity of species in Asia, species of the genus Trollius usually grow in heavy, wet clay soils.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Trollius_europaeus_020503.jpg/330px-Trollius_europaeus_020503.jpg"
  },
  "25": {
    "name": "grape hyacinth",
    "description": "Muscari is a genus of perennial bulbous plants native to Eurasia that produce spikes of dense, most commonly blue, urn-shaped flowers resembling bunches of grapes in the spring. The common name for the genus is grape hyacinth, but they should not be confused with hyacinths. A number of species of Muscari are used as ornamental garden plants.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/61/Muscari_Neglectum.jpg/330px-Muscari_Neglectum.jpg"
  },
  "26": {
    "name": "corn poppy",
    "description": "Papaver rhoeas, with common names including common poppy, corn poppy, corn rose, field poppy, Flanders poppy, red poppy, and Odai, is an annual herbaceous species of flowering plant in the poppy family Papaveraceae. It is native to north Africa and temperate Eurasia and is introduced into temperate areas on all other continents except Antarctica.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Papaver_rhoeas_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-101.jpg/330px-Papaver_rhoeas_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-101.jpg"
  },
  "79": {
    "name": "toad lily",
    "description": "Tricyrtis is a genus of Asian flowering plants in the lily family, with approximately 20 known species. The species are commonly known in English as toad lilies. The genus has a native range from the Himalayas to eastern Asia, including China, Japan, Philippines and Taiwan, and a few species are cultivated for their ornamental qualities in other parts of the world.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Tricyrtis_hirta_-_blossom_top_%28aka%29.jpg/330px-Tricyrtis_hirta_-_blossom_top_%28aka%29.jpg"
  },
  "39": {
    "name": "siam tulip",
    "description": "Curcuma alismatifolia, Siam tulip or summer tulip is a tropical plant native to Laos, northern Thailand, and Cambodia. Despite its name, it is not related to the tulip, but is a close relative of turmeric. It can grow as an indoor plant. It is a perennial herb growing up to 2 feet tall.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Siam_Tulip.jpg/330px-Siam_Tulip.jpg"
  },
  "24": {
    "name": "red ginger",
    "description": "Alpinia purpurata, commonly referred to as red ginger, ostrich plume and pink cone ginger, is a ginger native to Maluku and the southwest Pacific islands. In typical ginger fashion, A. purpurata is a rhizomatous plant, spreading underground in a horizontal growth habit, sending feeder roots downwards into the substrate and sprouting leafy vertical stems from nodes located along the rhizome. As its common name implies, red ginger blooms with showy inflorescences on long, bright magenta- to red-hued bracts; while they appear to be a blossom, bracts are in fact modified leaves that contain the plant's actual flowers. Bracts are a common feature of many botanical genera, having evolved to protect and resemble the flowers and appeal to pollinators. The actual flower \"parts\" are located inside, often accessed by crawling insects like ants or beetles.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Red_ginger_%28Alpinia_purpurata%29_in_the_Water_Gardens_of_Vaipahi_on_Tahiti.jpg/330px-Red_ginger_%28Alpinia_purpurata%29_in_the_Water_Gardens_of_Vaipahi_on_Tahiti.jpg"
  },
  "67": {
    "name": "spring crocus",
    "description": "Crocus vernus is a species in Family Iridaceae, native to the Alps, the Pyrenees, and the Balkans. Its cultivars and those of Crocus flavus are used as ornamental plants. The Dutch crocuses are larger than the other cultivated crocus species. Depending on the year, Crocus vernus starts flowering about the same time or up to 2 weeks after Crocus chrysanthus starts flowering. Height: 4–6 inches (10–15 cm).",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e2/Crocus_vernus_with_bee.jpg/330px-Crocus_vernus_with_bee.jpg"
  },
  "35": {
    "name": "alpine sea holly",
    "description": "Eryngium alpinum, the alpine sea holly, alpine eryngo or queen of the Alps, is a herbaceous perennial plant in the family Apiaceae.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/88/Alpen-Mannstreu_%28Eryngium_alpinum%29_04.jpg/330px-Alpen-Mannstreu_%28Eryngium_alpinum%29_04.jpg"
  },
  "32": {
    "name": "garden phlox",
    "description": "Phlox paniculata is a species of flowering plant in the phlox family (Polemoniaceae). It is native to parts of the eastern and central United States. It is extensively cultivated in temperate regions as an ornamental plant and has become established in the wild in scattered locales in other regions. Common names include fall phlox, garden phlox, perennial phlox, summer phlox, and panicled phlox.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Phlox_paniculata_eva_cullum.jpeg/330px-Phlox_paniculata_eva_cullum.jpeg"
  },
  "10": {
    "name": "globe thistle",
    "description": "Echinops is a genus of about 130 species of flowering plants in the family Asteraceae, commonly known as globe thistles. They have spiny foliage and produce blue or white spherical flower heads. They are distributed from central Asia, Mongolia and north-eastern China to the Mediterranean basin, temperate regions of Eurasia, reaching to Indian subcontinent and tropical Africa. Globe thistle is the host plant of weevils Larinus vulpes and Larinus onopordi.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Echinops_adenocaulos.jpg/330px-Echinops_adenocaulos.jpg"
  },
  "6": {
    "name": "tiger lily",
    "description": "Tiger lily or Tiger Lily may refer to:",
    "image_url": null
  },
  "93": {
    "name": "ball moss",
    "description": "Tillandsia recurvata, commonly known as small ballmoss or ball moss, is a flowering plant in the family Bromeliaceae that grows upon larger host plants. It grows well in areas with low light, little airflow, and high humidity, which is commonly provided by southern shade trees, often the southern live oak. It is not a parasite like mistletoe, but an epiphyte like its relative Spanish moss.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ef/Tillandsia_recurvata_%28Family_Bromeliaceae%29.jpg/330px-Tillandsia_recurvata_%28Family_Bromeliaceae%29.jpg"
  },
  "33": {
    "name": "love in the mist",
    "description": "No description found.",
    "image_url": null
  },
  "9": {
    "name": "monkshood",
    "description": "Aconitum, also known as aconite, monkshood, wolfsbane, leopard's bane, devil's helmet, or blue rocket, is a genus of over 250 species of flowering plants belonging to the family Ranunculaceae. These herbaceous perennial plants are chiefly native to the mountainous parts of the Northern Hemisphere in North America, Europe, and Asia, growing in the moisture-retentive but well-draining soils of mountain meadows.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/ff/Aconitum_variegatum_110807f.jpg/330px-Aconitum_variegatum_110807f.jpg"
  },
  "102": {
    "name": "blackberry lily",
    "description": "Iris domestica, commonly known as leopard lily, blackberry lily, and leopard flower, is an ornamental plant in the family Iridaceae. In 2005, based on molecular DNA sequence evidence, Belamcanda chinensis, the sole species in the genus Belamcanda, was transferred to the genus Iris and renamed Iris domestica.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Belamcanda_chinensis_2007.jpg/330px-Belamcanda_chinensis_2007.jpg"
  },
  "14": {
    "name": "spear thistle",
    "description": "Cirsium vulgare, commonly known as spear thistle, bull thistle, or common thistle, is a species of the Asteraceae genus Cirsium, native throughout most of Europe, Western Asia, and northwestern Africa. It is also naturalised in North America, Africa, and Australia and is an invasive weed in several regions. It is the national flower of Scotland.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/20160729Cirsium_vulgare5.jpg/330px-20160729Cirsium_vulgare5.jpg"
  },
  "19": {
    "name": "balloon flower",
    "description": "Platycodon grandiflorus is a species of herbaceous flowering perennial plant of the family Campanulaceae, and the only member of the genus Platycodon. It is native to East Asia. It is commonly known as balloon flower, Chinese bellflower, or platycodon.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Platycodon_grandiflorum2.jpg/330px-Platycodon_grandiflorum2.jpg"
  },
  "100": {
    "name": "blanket flower",
    "description": "Gaillardia is a genus of flowering plants in the family Asteraceae, native to North and South America. It was named after Maître Gaillard de Charentonneau, an 18th-century French magistrate who was an enthusiastic botanist. The common name may refer to the resemblance of the inflorescence to the brightly patterned blankets made by Native Americans, or to the ability of wild taxa to blanket the ground with colonies. Many cultivars have been bred for ornamental use.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Gaillardia_in_Aspen_%2891273%29.jpg/330px-Gaillardia_in_Aspen_%2891273%29.jpg"
  },
  "13": {
    "name": "king protea",
    "description": "Protea cynaroides, also called the king protea, is a flowering plant. It is a distinctive member of Protea, having the largest flower head in the genus. The species is also known as giant protea, honeypot or king sugar bush. It is widely distributed in the southwestern and southern parts of South Africa in the fynbos region.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Protea_cynaroides_3.jpg/330px-Protea_cynaroides_3.jpg"
  },
  "49": {
    "name": "oxeye daisy",
    "description": "Leucanthemum vulgare, commonly known as the ox-eye daisy, oxeye daisy, dog daisy, marguerite and other common names, is a widespread flowering plant native to Europe and the temperate regions of Asia, and an introduced plant to North America, Australia and New Zealand.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e7/Leucanthemum_vulgare_%27Filigran%27_Flower_2200px.jpg/330px-Leucanthemum_vulgare_%27Filigran%27_Flower_2200px.jpg"
  },
  "15": {
    "name": "yellow iris",
    "description": "Iris pseudacorus, the yellow flag, yellow iris, or water flag, is a species of flowering plant in the family Iridaceae. It is native to Europe, western Asia and northwest Africa. Its specific epithet pseudacorus means \"false acorus\", referring to the similarity of its leaves to those of Acorus calamus, as they have a prominently veined mid-rib and sword-like shape. However, the two plants are not closely related.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Iris_pseudacorus_iris_des_marais.jpg/330px-Iris_pseudacorus_iris_des_marais.jpg"
  },
  "61": {
    "name": "cautleya spicata",
    "description": "Cautleya spicata is a perennial herbaceous plant in the family Zingiberaceae. It is found in the Himalayas through to China (Yunnan). It is cultivated as an ornamental garden plant, hardy to a few degrees of frost.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Cautleya_spicata_%27Crug_Cardinal%27_310806.jpg"
  },
  "31": {
    "name": "carnation",
    "description": "Dianthus caryophyllus, commonly known as carnation or clove pink, is a species of Dianthus native to the Mediterranean region. Its exact natural range is uncertain due to extensive cultivation over the last 2,000 years. Carnations are prized for their vibrant colors, delicate fringed petals, and fragrance.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/W_carnation4051.jpg/330px-W_carnation4051.jpg"
  },
  "64": {
    "name": "silverbush",
    "description": "Silverbush or Silver bush may refer to various flowering plants with a silvery appearance including:Argythamnia\nConvolvulus cneorum\nSophora tomentosa subsp. australis\n",
    "image_url": null
  },
  "68": {
    "name": "bearded iris",
    "description": "Iris is a flowering plant genus of 310 accepted species with showy flowers. As well as being the scientific name, iris is also widely used as a common name for all Iris species, as well as some belonging to other closely related genera. A common name for some species is flags, while the plants of the subgenus Scorpiris are widely known as junos, particularly in horticulture. It is a popular garden flower.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f8/Iris_sanguinea_cultivar%2C_Wakehurst_Place%2C_UK_-_Diliff.jpg/330px-Iris_sanguinea_cultivar%2C_Wakehurst_Place%2C_UK_-_Diliff.jpg"
  },
  "63": {
    "name": "black-eyed susan",
    "description": "Black-eyed Susan may refer to:",
    "image_url": null
  },
  "69": {
    "name": "windflower",
    "description": "Windflower may refer to:",
    "image_url": null
  },
  "62": {
    "name": "japanese anemone",
    "description": "Eriocapitella japonica is a species of flowering plant in the buttercup family Ranunculaceae. The specific epithet japonica means \"from Japan\", which is a misnomer since the species is introduced in Japan. It is native to China, Taiwan, and Vietnam.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/9c/Anemone_japonica_-_GBA_Viote_39.jpg/330px-Anemone_japonica_-_GBA_Viote_39.jpg"
  },
  "20": {
    "name": "giant white arum lily",
    "description": "Zantedeschia aethiopica, commonly known as calla lily and arum lily, is a species of flowering plant in the family Araceae, native to southern Africa in Lesotho, South Africa, and Eswatini.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a2/Zantedeschia_aethiopica_-1.jpg/330px-Zantedeschia_aethiopica_-1.jpg"
  },
  "38": {
    "name": "great masterwort",
    "description": "Great masterwort is the common name of several flowering plants in the genus Astrantia, including:Astrantia maxima (\"largest\"), with pinkish-white flowers\nAstrantia major (\"larger\"), with greenish-white flowers with reddish shades",
    "image_url": null
  },
  "4": {
    "name": "sweet pea",
    "description": "The sweet pea, Lathyrus odoratus, is a flowering plant in the genus Lathyrus in the family Fabaceae (legumes), native to Sicily, southern Italy and the Aegean Islands.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d7/Sweet_Pea-7.jpg/330px-Sweet_Pea-7.jpg"
  },
  "86": {
    "name": "tree mallow",
    "description": "Malva arborea, the tree mallow, is a species of mallow native to the coasts of western Europe and the Mediterranean region, from Ireland and Britain south to Algeria and Libya, and east to Greece.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/89/Lavatera_arborea1.jpg/330px-Lavatera_arborea1.jpg"
  },
  "101": {
    "name": "trumpet creeper",
    "description": "Campsis radicans, the trumpet vine, yellow trumpet vine, or trumpet creeper, is a species of flowering plant in the trumpet vine family Bignoniaceae, native to eastern North America, and naturalized elsewhere. Growing to 10 metres, it is a vigorous, deciduous woody vine, notable for its showy trumpet-shaped flowers. It inhabits woodlands and riverbanks, and is also a popular garden plant.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/73/Campsis_radicans_-_Trumpet_Creeper.jpg/330px-Campsis_radicans_-_Trumpet_Creeper.jpg"
  },
  "42": {
    "name": "daffodil",
    "description": "Narcissus is a genus of predominantly spring flowering perennial plants of the amaryllis family, Amaryllidaceae. Various common names including daffodil, narcissus, and jonquil, are used to describe some or all members of the genus. Narcissus has conspicuous flowers with six petal-like tepals surmounted by a cup- or trumpet-shaped corona. The flowers are generally white and yellow, with either uniform or contrasting coloured tepals and corona.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/63/Narcissus_poeticus_subsp._radiiflorus.1658.jpg/330px-Narcissus_poeticus_subsp._radiiflorus.1658.jpg"
  },
  "22": {
    "name": "pincushion flower",
    "description": "A pincushion is a small cushion used in sewing to store pins or needles.",
    "image_url": null
  },
  "2": {
    "name": "hard-leaved pocket orchid",
    "description": "Paphiopedilum micranthum, described in 1951, is commonly known as the silver slipper orchid or hard-leaved pocket orchid. It blooms during late winter to early summer with one flower per inflorescence. As opposed to its close sibling Paph. malipoense, the flowers of Paph. micranthum have no fragrance.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Paphiopedilum_micranthum_Orchi_01.jpg/330px-Paphiopedilum_micranthum_Orchi_01.jpg"
  },
  "54": {
    "name": "sunflower",
    "description": "The common sunflower is a species of large annual forb of the daisy family Asteraceae. The common sunflower is harvested for its edible oily seeds, which are often eaten as a snack food. They are also used in the production of cooking oil, as food for livestock, as bird food, and as a plantings in domestic gardens for aesthetics. Wild plants are known for their multiple flower heads, whereas the domestic sunflower often possesses a single large flower head atop an unbranched stem.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Sunflower_sky_backdrop.jpg/330px-Sunflower_sky_backdrop.jpg"
  },
  "66": {
    "name": "osteospermum",
    "description": "Osteospermum, is a genus of flowering plants belonging to the Calenduleae, one of the smaller tribes of the sunflower/daisy family Asteraceae. They are known as the daisybushes or African daisies. Its species have been given several common names, including African daisy, South African daisy, Cape daisy and blue-eyed daisy.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/41/Osteospermum_spinosum_var._spinosum_1DS-II_1-9738.jpg/330px-Osteospermum_spinosum_var._spinosum_1DS-II_1-9738.jpg"
  },
  "70": {
    "name": "tree poppy",
    "description": "Tree poppy is a name used for various plants in the family Papaveraceae:Genus Dendromecon\nGenus Romneya\nBocconia frutescens\n",
    "image_url": null
  },
  "85": {
    "name": "desert-rose",
    "description": "Desert rose may refer to:",
    "image_url": null
  },
  "99": {
    "name": "bromelia",
    "description": "Bromelia is a genus of about 70 plant species widespread across Latin America and the West Indies. It is the type genus of the family Bromeliaceae, subfamily Bromelioideae, and its type species is B. karatas. Bromelia species are characterized by flowers with a deeply cleft calyx. The genus is named after the Swedish medical doctor and botanist Olof Bromelius (1639-1705).",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f7/Bromelia_karatas2.jpg/330px-Bromelia_karatas2.jpg"
  },
  "87": {
    "name": "magnolia",
    "description": "Magnolia is a large genus of about 210 to 340 flowering plant species in the subfamily Magnolioideae of the family Magnoliaceae. The natural range of Magnolia species is disjunct, with a main center in east, south and southeast Asia and a secondary center in eastern North America, Central America, the West Indies, and some species in South America.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a4/Magnolia_sieboldii_flower_1.jpg/330px-Magnolia_sieboldii_flower_1.jpg"
  },
  "5": {
    "name": "english marigold",
    "description": "Calendula officinalis, Mary's gold, common marigold, the pot marigold, Scotch marigold, or ruddles, is a flowering plant in the daisy family, Asteraceae. It is probably native to southern Europe, but its long history of cultivation makes its precise origin unknown, and it is widely naturalised. The florets are edible and the plant has historically been used as medicine.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Pot_marigold.jpg/330px-Pot_marigold.jpg"
  },
  "92": {
    "name": "bee balm",
    "description": "Monarda is a genus of flowering plants in the mint family, Lamiaceae. The genus is endemic to North America. Common names include bergamot, bee balm, horsemint, and oswego tea, the first being inspired by the fragrance of the leaves, which is reminiscent of bergamot orange. The genus was named for the Spanish botanist Nicolás Monardes, who wrote a book in 1574 describing plants of the New World.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/Monarda_didyma_00.jpg/330px-Monarda_didyma_00.jpg"
  },
  "28": {
    "name": "stemless gentian",
    "description": "Stemless gentian is a common name for several plants and may refer to:Gentiana acaulis, native to central and southern Europe\nGentiana clusii, native to Europe\n",
    "image_url": null
  },
  "97": {
    "name": "mallow",
    "description": "Mallow or mallows may refer to:",
    "image_url": null
  },
  "57": {
    "name": "gaura",
    "description": "Gaura was a genus of flowering plants in the family Onagraceae, native to North America. The name was derived from Greek γαῦρος (gaûros) meaning \"superb\" and named in reference to the stature and floral display of some species in this genus. The genus included many species known commonly as beeblossoms. Genetic research showed that the genus was paraphyletic unless the monotypic genus Stenosiphon is included within Gaura, increasing the number of species in the genus to 22. Gaura is now a synonym of Oenothera, with the bulk of the Gaura taxa in genus Oenothera sect. Gaura (L.) W.L.Wagner &Hoch.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/48/Gaura_lindheimeri4.jpg/330px-Gaura_lindheimeri4.jpg"
  },
  "40": {
    "name": "lenten rose",
    "description": "Commonly known as hellebores, the Eurasian genus Helleborus consists of approximately 20 species of herbaceous or evergreen perennial flowering plants in the family Ranunculaceae, within which it gave its name to the tribe of Helleboreae. Many hellebore species are poisonous.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b0/Illustration_Helleborus_niger0.jpg/330px-Illustration_Helleborus_niger0.jpg"
  },
  "47": {
    "name": "marigold",
    "description": "Marigold may refer to:Marigold (color), a yellow-orange color",
    "image_url": null
  },
  "59": {
    "name": "orange dahlia",
    "description": "No description found.",
    "image_url": null
  },
  "48": {
    "name": "buttercup",
    "description": "Ranunculus is a large genus of about 1750 species of flowering plants in the family Ranunculaceae. Members of the genus are known as buttercups, spearworts and water crowfoots.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Ranunculus_eschscholtzii.jpg/330px-Ranunculus_eschscholtzii.jpg"
  },
  "55": {
    "name": "pelargonium",
    "description": "Pelargonium is a genus of flowering plants that includes about 280 species of perennials, succulents, and shrubs, commonly called geraniums, pelargoniums, or storksbills. Geranium is also the botanical name and common name of a separate genus of related plants, also known as cranesbills. Both genera belong to the family Geraniaceae, and Carl Linnaeus originally included all the species in one genus, Geranium; they were later separated into two genera by Charles Louis L'Héritier de Brutelle in 1789.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0d/Pelargonium_cucullatum_Contour_Path_Rhodes_Mem.JPG/330px-Pelargonium_cucullatum_Contour_Path_Rhodes_Mem.JPG"
  },
  "36": {
    "name": "ruby-lipped cattleya",
    "description": "Cattleya labiata, also known as the crimson cattleya or ruby-lipped cattleya, is the type species of Cattleya, discovered in 1818 in Brazil.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Labiata.jpg/330px-Labiata.jpg"
  },
  "91": {
    "name": "hippeastrum",
    "description": "Hippeastrum is a genus of 116 species, and over 600 hybrids and cultivars, of perennial, herbaceous and bulbous plants, native to tropical and subtropical regions of the Americas, from Mexico south to Argentina and on some islands in the Caribbean. The majority have large, fleshy bulbs and tall, broad, strap-like leaves that are (generally) evergreen, and large red or purple flowers. Numerous colors and cultivars have been created over the past hundred years.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Hippeastrum_reginae.jpg/330px-Hippeastrum_reginae.jpg"
  },
  "29": {
    "name": "artichoke",
    "description": "The artichoke, also known by the other names: French artichoke, globe artichoke, and green artichoke in the United States, is a variety of a species of thistle cultivated as food.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Artichoke_J1.jpg/330px-Artichoke_J1.jpg"
  },
  "71": {
    "name": "gazania",
    "description": "Gazania is a genus of flowering plants in the family Asteraceae, native to Southern Africa.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e3/Gardenology.org-IMG_0043_rbgm10dec.jpg/330px-Gardenology.org-IMG_0043_rbgm10dec.jpg"
  },
  "90": {
    "name": "canna lily",
    "description": "Canna or canna lily is a genus of flowering plants consisting of 10 species. It is the only genus in the family Cannaceae. All of the genus's species are native to the American tropics and were naturalized in Europe, India and Africa in the 1860s. Although they grow native to the tropics, most cultivars have been developed in temperate climates and are easy to grow in most countries of the world, as long as they receive at least 6–8 hours average sunlight during the summer, and are moved to a warm location for the winter. See the Canna cultivar gallery for photographs of Canna cultivars.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8a/Canna_sp.jpg/330px-Canna_sp.jpg"
  },
  "18": {
    "name": "peruvian lily",
    "description": "Alstroemeria, commonly called the Peruvian lily or lily of the Incas, is a genus of flowering plants in the family Alstroemeriaceae. They are all native to South America, although some have become naturalized in the United States, Mexico, Australia, New Zealand, Madeira and the Canary Islands. Almost all of the species are restricted to one of two distinct centers of diversity: one in central Chile and southern Argentina, the other in eastern Brazil. Species of Alstroemeria from Patagonia are winter-growing plants, while those of Brazil are summer growing. All are long-lived perennials except A. graminea, a diminutive annual from the Atacama Desert of Chile.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Alstroemeria_aurantiaca.jpg/330px-Alstroemeria_aurantiaca.jpg"
  },
  "98": {
    "name": "mexican petunia",
    "description": "Ruellia simplex, the Mexican petunia, Mexican bluebell or Britton's wild petunia, is a species of flowering plant in the family Acanthaceae that is native to Mexico, the Caribbean, and South America. It has become a widespread invasive plant in Florida, where it was likely introduced as an ornamental before 1933, as well as in the eastern Mediterranean, South Asia and other parts of the eastern hemisphere.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Ruellia_Simplex_2024.jpg/330px-Ruellia_Simplex_2024.jpg"
  },
  "8": {
    "name": "bird of paradise",
    "description": "Bird of paradise may refer to:",
    "image_url": null
  },
  "30": {
    "name": "sweet william",
    "description": "Dianthus barbatus, the sweet William, is a species of flowering plant in the family Caryophyllaceae, native to southern Europe and parts of Asia. It has become a popular ornamental garden plant. It is a herbaceous biennial or short-lived perennial plant growing to 13–92 cm tall, with flowers in a dense cluster of up to 30 at the top of the stems. Each flower is 2–3 cm diameter with five petals displaying serrated edges. Wild plants produce red flowers with a white base, but colours in cultivars range from white, pink, red, and purple to variegated patterns. The exact origin of its English common name is unknown but first appears in 1596 in botanist John Gerard's garden catalogue. The flowers are edible and may have medicinal properties. Sweet William attracts bees, birds, and butterflies.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/Dianthus_barbatus_flowers_01.jpg/330px-Dianthus_barbatus_flowers_01.jpg"
  },
  "17": {
    "name": "purple coneflower",
    "description": "Echinacea purpurea, the eastern purple coneflower, purple coneflower, hedgehog coneflower, or Echinacea, is a North American species of flowering plant in the family Asteraceae. It is native to parts of eastern North America and present to some extent in the wild in much of the eastern, southeastern and midwestern United States, as well as in the Canadian Province of Ontario. It is most common in the Ozarks, the Mississippi Valley, and the Ohio Valley. Its habitats include dry open woods, prairies, and barrens.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/8e/Echinacea_purpurea_Grandview_Prairie.jpg/330px-Echinacea_purpurea_Grandview_Prairie.jpg"
  },
  "52": {
    "name": "wild pansy",
    "description": "Viola tricolor is a common European wild flower, growing as an annual or short-lived perennial. The species is also known as wild pansy, Johnny Jump up, heartsease, heart's ease, heart's delight, tickle-my-fancy, Jack-jump-up-and-kiss-me, come-and-cuddle-me, three faces in a hood, love-in-idleness, and pink of my john.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c0/Violatricolorarvensis.jpg/330px-Violatricolorarvensis.jpg"
  },
  "84": {
    "name": "columbine",
    "description": "Columbine may refer to:",
    "image_url": null
  },
  "12": {
    "name": "colt's foot",
    "description": "Coltsfoot is the common name for several plants in the family Asteraceae:Homogyne alpina, a plant species native to Europe\nPetasites, a plant genus native to Europe, Asia, and North America\nTussilago farfara, a plant species native to Europe and parts of Asia and Africa",
    "image_url": null
  },
  "11": {
    "name": "snapdragon",
    "description": "Antirrhinum is a genus of plants in the Plantaginaceae family, commonly known as dragon flowers or snapdragons because of the flowers' fancied resemblance to the face of a dragon that opens and closes its mouth when laterally squeezed. They are also sometimes called toadflax or dog flower. They are native to rocky areas of Europe, the United States, Canada, and North Africa. Antirrhinum species are widely used as ornamental plants in borders and as cut flowers.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/66/Antirrhinum_majus_from_Thasos.JPG/330px-Antirrhinum_majus_from_Thasos.JPG"
  },
  "96": {
    "name": "camellia",
    "description": "Camellia is a genus of flowering plants in the family Theaceae. They are found in tropical and subtropical areas in eastern and southern Asia, from the Himalayas east to Japan and Indonesia. There are more than 220 described species; almost all are found in southern China and Indochina. Camellias are popular ornamental, tea, and woody-oil plants cultivated worldwide for centuries. Over 26,000 cultivars, with more than 51,000 cultivar names, including synonyms, have been registered or published.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f4/Camellia_sasanqua1JAM343.jpg/330px-Camellia_sasanqua1JAM343.jpg"
  },
  "23": {
    "name": "fritillary",
    "description": "Fritillary may refer to:Fritillary (plant), a genus of flowering plants in the family Liliaceae\nFritillary (butterfly), the name of various species in several different genera of nymphalid butterflies",
    "image_url": null
  },
  "50": {
    "name": "common dandelion",
    "description": "Taraxacum officinale, the dandelion or common dandelion, is a herbaceous perennial flowering plant in the daisy family, Asteraceae. The common dandelion is well known for its yellow flower heads that turn into round balls of many silver-tufted fruit that disperse in the wind. These balls are called \"clocks\" in both British and American English. The name \"blowball\" is also used.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Taraxacum_officinale_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-135.jpg/330px-Taraxacum_officinale_-_K%C3%B6hler%E2%80%93s_Medizinal-Pflanzen-135.jpg"
  },
  "44": {
    "name": "poinsettia",
    "description": "The poinsettia is a commercially important flowering plant species of the diverse spurge family Euphorbiaceae. Indigenous to Mexico and Central America, the poinsettia was first described by Europeans in 1834. It is particularly well known for its red and green foliage and is widely used in Christmas floral displays. It derives its common English name from Joel Roberts Poinsett, the first United States minister to Mexico, who is credited with introducing the plant to the US in the 1820s. Poinsettias are shrubs or small trees, with heights of 0.6 to 4 m. Though often stated to be highly toxic, the poinsettia is not dangerous to pets or children. Exposure to the plant, even consumption, most often results in no effect, though it can cause nausea, vomiting, or diarrhea.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e1/Weihnachtsstern_-_gro%C3%9F.jpg/330px-Weihnachtsstern_-_gro%C3%9F.jpg"
  },
  "53": {
    "name": "primula",
    "description": "Primula is a genus of herbaceous flowering plants in the family Primulaceae. They include the primrose, a familiar wildflower of banks and verges. Other common species are P. auricula (auricula), P. veris (cowslip), and P. elatior (oxlip). These species and many others are valued for their ornamental flowers. They have been extensively cultivated and hybridised. Primula are native to the temperate Northern Hemisphere, south into tropical mountains in Ethiopia, Indonesia, and New Guinea, and in temperate southern South America. Almost half of the known species are from the Himalayas.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/ad/Prole%C4%87no_cve%C4%87e_3.JPG/330px-Prole%C4%87no_cve%C4%87e_3.JPG"
  },
  "72": {
    "name": "azalea",
    "description": "Azaleas are flowering shrubs in the genus Rhododendron, particularly the former sections Tsutsusi (evergreen) and Pentanthera (deciduous). Azaleas bloom in the spring, their flowers often lasting several weeks. Shade tolerant, they prefer living near or under trees. They are part of the family Ericaceae.",
    "image_url": null
  },
  "65": {
    "name": "californian poppy",
    "description": "Eschscholzia californica, the California poppy, golden poppy, Mexican poppy, California sunlight or cup of gold, is a species of flowering plant in the family Papaveraceae, native to the United States and Mexico. It is cultivated as an ornamental plant flowering in summer, with showy flowers in brilliant shades of red, orange and yellow. It is also used as food or a garnish. It had various uses in indigenous herbalism. It became the official state flower of California in 1903.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Kaldari_Eschscholzia_californica_01.jpg/330px-Kaldari_Eschscholzia_californica_01.jpg"
  },
  "80": {
    "name": "anthurium",
    "description": "Anthurium is a genus of about 1,000 species of flowering plants, the largest genus of the arum family, Araceae. General common names include anthurium, tailflower, flamingo flower, pigtail plant, and laceleaf.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/75/Anthurium3.JPG/330px-Anthurium3.JPG"
  },
  "76": {
    "name": "morning glory",
    "description": "Morning glory is the common name for over 1,000 species of flowering plants in the family Convolvulaceae, whose taxonomy and systematics remain in flux. These species are distributed across numerous genera, including:Argyreia\nAstripomoea\nCalystegia\nConvolvulus\nIpomoea \nLepistemon\nMerremia\nOperculina\nRivea\nStictocardia",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/90/Ipomoea_tricolor_%27Heavenly_Blue%27.jpg/330px-Ipomoea_tricolor_%27Heavenly_Blue%27.jpg"
  },
  "37": {
    "name": "cape flower",
    "description": "No description found.",
    "image_url": null
  },
  "56": {
    "name": "bishop of llandaff",
    "description": "The Bishop of Llandaff is the ordinary of the Church in Wales Diocese of Llandaff.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Coat_of_Arms_of_the_Diocese_of_Llandaff.svg/330px-Coat_of_Arms_of_the_Diocese_of_Llandaff.svg.png"
  },
  "60": {
    "name": "pink-yellow dahlia",
    "description": "No description found.",
    "image_url": null
  },
  "82": {
    "name": "clematis",
    "description": "Clematis is a genus of about 380 species within the buttercup family, Ranunculaceae. Their garden hybrids and cultivars have been popular among gardeners, beginning with Clematis 'Jackmanii', a garden staple since 1862; more cultivars are being produced constantly. They are mainly of Chinese and Japanese origin.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/70/Clematis_%27Nelly_Moser%27.JPG/330px-Clematis_%27Nelly_Moser%27.JPG"
  },
  "58": {
    "name": "geranium",
    "description": "Geranium is a genus of 422 species of annual, biennial, and perennial plants that are commonly known as geraniums or cranesbills. They are found throughout the temperate regions of the world and the mountains of the tropics, with the greatest diversity in the eastern part of the Mediterranean region.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a7/Geranium_February_2008-1.jpg/330px-Geranium_February_2008-1.jpg"
  },
  "75": {
    "name": "thorn apple",
    "description": "Thornapple may refer to:",
    "image_url": null
  },
  "41": {
    "name": "barbeton daisy",
    "description": "No description found.",
    "image_url": null
  },
  "95": {
    "name": "bougainvillea",
    "description": "Bougainvillea is a genus of thorny ornamental vines, bushes, and trees belonging to the four o'clock family, Nyctaginaceae. They are native to Brazil, Bolivia, Paraguay, Peru, and Argentina. There are between 4 and 22 species in the genus. The inflorescence consists of large colourful sepal-like bracts which surround three simple waxy flowers, gaining popularity for the plant as an ornamental. The plant is named after explorer Louis Antoine de Bougainville (1729–1811), after it was documented on one of his expeditions.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4c/Bougainvillea_closeup.jpg/330px-Bougainvillea_closeup.jpg"
  },
  "43": {
    "name": "sword lily",
    "description": "Gladiolus is a genus of perennial cormous flowering plants in the iris family (Iridaceae).",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/0_Gladiolus_italicus_-_Samo%C3%ABns_%281%29.JPG/330px-0_Gladiolus_italicus_-_Samo%C3%ABns_%281%29.JPG"
  },
  "83": {
    "name": "hibiscus",
    "description": "Hibiscus is a genus of flowering plants in the mallow family, Malvaceae. The genus is quite large, comprising several hundred species that are native to warm temperate, subtropical and tropical regions throughout the world. Member species are renowned for their large, showy flowers and those species are commonly known simply as \"hibiscus\", or less widely known as rose mallow. The genus includes both annual and perennial herbaceous plants, as well as woody shrubs and small trees.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Hibiscus_flower_TZ.jpg/330px-Hibiscus_flower_TZ.jpg"
  },
  "78": {
    "name": "lotus lotus",
    "description": "No description found.",
    "image_url": null
  },
  "88": {
    "name": "cyclamen",
    "description": "Cyclamen is a genus of 23 species of perennial flowering plants in the family Primulaceae. In English, it is known by the common names sowbread or swinebread. Cyclamen species are native to Europe and the Mediterranean Basin east to the Caucasus and Iran, with one species in Somalia. They grow from tubers and are valued for their flowers with upswept petals and variably patterned leaves.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/de/Wild_cyclamens.jpg/330px-Wild_cyclamens.jpg"
  },
  "94": {
    "name": "foxglove",
    "description": "Digitalis is a genus of about 20 species of herbaceous perennial plants, shrubs, and biennials, commonly called foxgloves.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/74/Digitalis_purpurea2.jpg/330px-Digitalis_purpurea2.jpg"
  },
  "81": {
    "name": "frangipani",
    "description": "Plumeria, also known as frangipani, is a genus of flowering plants in the subfamily Rauvolfioideae, of the family Apocynaceae. Most species are deciduous shrubs or small trees. The species are native to the Neotropical realm, but are often grown as cosmopolitan ornamentals in tropical regions, especially in Hawaii, as well as hot desert climates in the Arabian Peninsula with proper irrigation.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/ed/Plumeria_rubra-4.JPG/330px-Plumeria_rubra-4.JPG"
  },
  "74": {
    "name": "rose",
    "description": "A rose is either a woody perennial flowering plant of the genus Rosa, in the family Rosaceae, or the flower it bears. There are over three hundred species and tens of thousands of cultivars. They form a group of plants that can be erect shrubs, climbing, or trailing, with stems that are often armed with sharp prickles. Their flowers vary in size and shape and are usually large and showy, in colours ranging from white through pinks, reds, oranges and yellows. Most species are native to Asia, with smaller numbers native to Europe, North America, and Northwest Africa. Species, cultivars and hybrids are all widely grown for their beauty and often are fragrant. Roses have acquired cultural significance in many societies. Rose plants range in size from compact, miniature roses to climbers that can reach seven meters in height. Different species hybridize easily, and this has been used in the development of the wide range of garden roses.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e6/Rosa_rubiginosa_1.jpg/330px-Rosa_rubiginosa_1.jpg"
  },
  "89": {
    "name": "watercress",
    "description": "Watercress or yellowcress is a species of aquatic flowering plant in the cabbage family, Brassicaceae.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/dd/Watercress_%282%29.JPG/330px-Watercress_%282%29.JPG"
  },
  "73": {
    "name": "water lily",
    "description": "Water lily or water lilies may refer to:",
    "image_url": null
  },
  "46": {
    "name": "wallflower",
    "description": "Erysimum, or wallflower, is a genus of flowering plants in the cabbage family, Brassicaceae. It includes more than 150 species, both popular garden plants and many wild forms. Erysimum is characterised by star-shaped and/or two-sided) trichomes growing from the stem, with yellow, red, pink or orange flowers and multiseeded seed pods.",
    "image_url": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1c/Erysimum-scoparium.jpg/330px-Erysimum-scoparium.jpg"
  },
  "77": {
    "name": "passion flower",
    "description": "Passiflora, known also as the passion flowers or passion vines, is a genus of about 550 species of flowering plants, the type genus of the family Passifloraceae.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/OQ_Passion_flower.jpg/330px-OQ_Passion_flower.jpg"
  },
  "51": {
    "name": "petunia",
    "description": "Petunia is a genus of 20 species of flowering plants of South American origin. The popular flower of the same name derived its epithet from the French, which took the word pétun, 'tobacco', from a Tupi–Guarani language. A tender perennial plant, most of the varieties seen in gardens are hybrids.",
    "image_url": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fb/Petunia_exserta_by_Scott_Zona_-_004_%281%29.jpg/330px-Petunia_exserta_by_Scott_Zona_-_004_%281%29.jpg"
  }
}